espressif/esp-idf/components/soc/esp32p4/register/hw_ver3/soc/mipi_csi_host_struct.h
/**
 * SPDX-FileCopyrightText: 2025 Espressif Systems (Shanghai) CO LTD
 *
 *  SPDX-License-Identifier: Apache-2.0
 */
#pragma once

#include <stdint.h>
#ifdef __cplusplus
extern "C" {
#endif

/** Group: Version Register */
/** Type of version register
 *  NA
 */
typedef union {
    struct {
        /** version : RO; bitpos: [31:0]; default: 825569322;
         *  NA
         */
        uint32_t version:32;
    };
    uint32_t val;
} csi_host_version_reg_t;


/** Group: Configuration Registers */
/** Type of n_lanes register
 *  NA
 */
typedef union {
    struct {
        /** n_lanes : R/W; bitpos: [2:0]; default: 1;
         *  NA
         */
        uint32_t n_lanes:3;
        uint32_t reserved_3:29;
    };
    uint32_t val;
} csi_host_n_lanes_reg_t;

/** Type of csi2_resetn register
 *  NA
 */
typedef union {
    struct {
        /** csi2_resetn : R/W; bitpos: [0]; default: 0;
         *  NA
         */
        uint32_t csi2_resetn:1;
        uint32_t reserved_1:31;
    };
    uint32_t val;
} csi_host_csi2_resetn_reg_t;

/** Type of phy_shutdownz register
 *  NA
 */
typedef union {
    struct {
        /** phy_shutdownz : R/W; bitpos: [0]; default: 0;
         *  NA
         */
        uint32_t phy_shutdownz:1;
        uint32_t reserved_1:31;
    };
    uint32_t val;
} csi_host_phy_shutdownz_reg_t;

/** Type of dphy_rstz register
 *  NA
 */
typedef union {
    struct {
        /** dphy_rstz : R/W; bitpos: [0]; default: 0;
         *  NA
         */
        uint32_t dphy_rstz:1;
        uint32_t reserved_1:31;
    };
    uint32_t val;
} csi_host_dphy_rstz_reg_t;

/** Type of phy_rx register
 *  NA
 */
typedef union {
    struct {
        /** phy_rxulpsesc_0 : RO; bitpos: [0]; default: 0;
         *  NA
         */
        uint32_t phy_rxulpsesc_0:1;
        /** phy_rxulpsesc_1 : RO; bitpos: [1]; default: 0;
         *  NA
         */
        uint32_t phy_rxulpsesc_1:1;
        uint32_t reserved_2:14;
        /** phy_rxulpsclknot : RO; bitpos: [16]; default: 1;
         *  NA
         */
        uint32_t phy_rxulpsclknot:1;
        /** phy_rxclkactivehs : RO; bitpos: [17]; default: 0;
         *  NA
         */
        uint32_t phy_rxclkactivehs:1;
        uint32_t reserved_18:14;
    };
    uint32_t val;
} csi_host_phy_rx_reg_t;

/** Type of phy_test_ctrl0 register
 *  NA
 */
typedef union {
    struct {
        /** phy_testclr : R/W; bitpos: [0]; default: 1;
         *  NA
         */
        uint32_t phy_testclr:1;
        /** phy_testclk : R/W; bitpos: [1]; default: 0;
         *  NA
         */
        uint32_t phy_testclk:1;
        uint32_t reserved_2:30;
    };
    uint32_t val;
} csi_host_phy_test_ctrl0_reg_t;

/** Type of phy_test_ctrl1 register
 *  NA
 */
typedef union {
    struct {
        /** phy_testdin : R/W; bitpos: [7:0]; default: 0;
         *  NA
         */
        uint32_t phy_testdin:8;
        /** phy_testdout : RO; bitpos: [15:8]; default: 0;
         *  NA
         */
        uint32_t phy_testdout:8;
        /** phy_testen : R/W; bitpos: [16]; default: 0;
         *  NA
         */
        uint32_t phy_testen:1;
        uint32_t reserved_17:15;
    };
    uint32_t val;
} csi_host_phy_test_ctrl1_reg_t;

/** Type of vc_extension register
 *  NA
 */
typedef union {
    struct {
        /** vcx : R/W; bitpos: [0]; default: 0;
         *  NA
         */
        uint32_t vcx:1;
        uint32_t reserved_1:31;
    };
    uint32_t val;
} csi_host_vc_extension_reg_t;

/** Type of phy_cal register
 *  NA
 */
typedef union {
    struct {
        /** rxskewcalhs : RC; bitpos: [0]; default: 0;
         *  NA
         */
        uint32_t rxskewcalhs:1;
        uint32_t reserved_1:31;
    };
    uint32_t val;
} csi_host_phy_cal_reg_t;

/** Type of scrambling register
 *  NA
 */
typedef union {
    struct {
        /** scramble_enable : R/W; bitpos: [0]; default: 0;
         *  NA
         */
        uint32_t scramble_enable:1;
        uint32_t reserved_1:31;
    };
    uint32_t val;
} csi_host_scrambling_reg_t;

/** Type of scrambling_seed1 register
 *  NA
 */
typedef union {
    struct {
        /** scramble_seed_lane1 : R/W; bitpos: [15:0]; default: 4104;
         *  NA
         */
        uint32_t scramble_seed_lane1:16;
        uint32_t reserved_16:16;
    };
    uint32_t val;
} csi_host_scrambling_seed1_reg_t;

/** Type of scrambling_seed2 register
 *  NA
 */
typedef union {
    struct {
        /** scramble_seed_lane2 : R/W; bitpos: [15:0]; default: 4488;
         *  NA
         */
        uint32_t scramble_seed_lane2:16;
        uint32_t reserved_16:16;
    };
    uint32_t val;
} csi_host_scrambling_seed2_reg_t;


/** Group: Interrupt Registers */
/** Type of int_st_main register
 *  NA
 */
typedef union {
    struct {
        /** st_status_int_phy_fatal : RC; bitpos: [0]; default: 0;
         *  NA
         */
        uint32_t st_status_int_phy_fatal:1;
        /** st_status_int_pkt_fatal : RC; bitpos: [1]; default: 0;
         *  NA
         */
        uint32_t st_status_int_pkt_fatal:1;
        /** st_status_int_bndry_frame_fatal : RC; bitpos: [2]; default: 0;
         *  NA
         */
        uint32_t st_status_int_bndry_frame_fatal:1;
        /** st_status_int_seq_frame_fatal : RC; bitpos: [3]; default: 0;
         *  NA
         */
        uint32_t st_status_int_seq_frame_fatal:1;
        /** st_status_int_crc_frame_fatal : RC; bitpos: [4]; default: 0;
         *  NA
         */
        uint32_t st_status_int_crc_frame_fatal:1;
        /** st_status_int_pld_crc_fatal : RC; bitpos: [5]; default: 0;
         *  NA
         */
        uint32_t st_status_int_pld_crc_fatal:1;
        /** st_status_int_data_id : RC; bitpos: [6]; default: 0;
         *  NA
         */
        uint32_t st_status_int_data_id:1;
        /** st_status_int_ecc_corrected : RC; bitpos: [7]; default: 0;
         *  NA
         */
        uint32_t st_status_int_ecc_corrected:1;
        uint32_t reserved_8:8;
        /** st_status_int_phy : RC; bitpos: [16]; default: 0;
         *  NA
         */
        uint32_t st_status_int_phy:1;
        uint32_t reserved_17:15;
    };
    uint32_t val;
} csi_host_int_st_main_reg_t;

/** Type of int_st_phy_fatal register
 *  NA
 */
typedef union {
    struct {
        /** st_phy_errsotsynchs_0 : RC; bitpos: [0]; default: 0;
         *  NA
         */
        uint32_t st_phy_errsotsynchs_0:1;
        /** st_phy_errsotsynchs_1 : RC; bitpos: [1]; default: 0;
         *  NA
         */
        uint32_t st_phy_errsotsynchs_1:1;
        uint32_t reserved_2:30;
    };
    uint32_t val;
} csi_host_int_st_phy_fatal_reg_t;

/** Type of int_msk_phy_fatal register
 *  NA
 */
typedef union {
    struct {
        /** mask_phy_errsotsynchs_0 : R/W; bitpos: [0]; default: 0;
         *  NA
         */
        uint32_t mask_phy_errsotsynchs_0:1;
        /** mask_phy_errsotsynchs_1 : R/W; bitpos: [1]; default: 0;
         *  NA
         */
        uint32_t mask_phy_errsotsynchs_1:1;
        uint32_t reserved_2:30;
    };
    uint32_t val;
} csi_host_int_msk_phy_fatal_reg_t;

